<template>
  <div class="agreement">
    <agreement-text
      v-for="item in agreement"
      :key="item.title"
      :title="item.title"
      :content="item.content"
    />
  </div>
</template>

<script setup lang="ts">
import AgreementText from "./components/agreement-text.vue";

const agreement = [
  {
    title: "甲方",
    content: "拾宠 - 宠物领养平台",
  },
  {
    title: "乙方",
    content: "拾宠平台用户",
  },
  {
    title: "前言",
    content:
      "首先，感谢您对流浪动物的关注和爱心，无锡爱护动物志愿者协会是一家从事动物保护、动物福利和公众环保教育的非营利、非宗教民间动物保护机构，主要倡导人与动物和谐共处的爱护动物理念，反对任何虐待动物的行为，推广人与动物共同受益的动物福利和保护政策。。如果您经过慎重的考虑，有足够的信心和能力，愿意用自己的爱心照顾它们一生，那么请您先仔细阅读以下领养要求",
  },
  {
    title: "协议内容",
    content:
      "甲乙双方经友好协商，就领养猫狗事宜达成协议：甲方所救助之流浪猫狗交由乙方喂养。",
  },
  {
    title: "甲方的权利以及义务",
    content: `1、向乙方如实告之领养动物之健康状况、性格、爱好、生活习惯等情况。
2、为乙方领养及日后喂养动物提供必要的咨询和协助。
3、安排合适的人员定期对领养家庭家访，以便沟通信息、解决问题。`,
  },
  {
    title: "乙方的权利以及义务",
    content: `1、领养人必须年满18周岁。（18周岁以下的未成年人领养需要家长出面与我们联系办理领养手续。)
2、领养人需具有独立的经济来源，领养期间内产生的一切费用由领养人自行承担。无锡市范围内（包括江阴、宜兴地区）的领养人，在无锡有稳定的工作和固定独立住所（租住需征得房东和室友同意）。
3、事先与家人做必要的沟通及商议，不得因家人反对、婚姻、生育、工作变动等原因抛弃领养猫狗。
4、申请人需亲自选定领养猫狗，不得请其他人代劳。并出示身份证或其他有效证件，外地户口需提供暂住证。（领养时留复印件存档，为保证您的个人信息安全，请在复印件上注明：领养专用，不得用作其他用途。）
5、协助甲方对喂养情况进行了解及回访。甲方的志愿者会以上门、电话、微信、QQ等形式进行定期回访,以了解被领养猫狗在新家的情况。回访期间发现乙方有违反本协议的行为，甲方有权将被领养猫狗无条件收回。（加回访群：202524155，每月上传3张以上生活照。）
6、领养时根据情况可能需交一定的领养押金，在领养人为领养的猫狗绝育(请保留绝育证明)并进行3次回访后（历时半年左右），将全额退回押金。回访期间如领养猫狗死亡或失踪（包含事后由志愿者找回），押金将作为救助基金不予退还。
7、定期为猫狗接种疫苗，体内外驱虫。科学喂养，生病及时求医，提供水、食物、避风遮雨的房舍、正常锻炼、洗澡梳理。
8、领养猫狗未绝育的请务必适时为其绝育，坚决反对领养猫狗进行繁殖的行为。
9、如遇不可抗力无法继续饲养，请及时和我组织联系，需将猫狗重新送还甲方。未经甲方同意不得自行转交他人或将其抛弃。如猫狗在领养期内死亡，要及时告知甲方，并说明死亡原因。
10、领养人联系方式或地址有变动，需及时与甲方联系，并告知新的联系方式与地址。`,
  },
  {
    title: "生效日期",
    content:
      "本协议自甲乙双方签订之日起生效。自生效之日起，乙方有违约行为，甲方可单方解除本协议。协议生效期间如发生被领养猫狗被遗弃、转让、贩卖、食用、虐待等恶劣行为，甲方将依据本协议对乙方追究法律责任。",
  },
  {
    title: "特别说明",
    content: `1、如有争议，双方应协商解决。如协商不成，双方可向当地法院提起诉讼，诉讼所产生的费用由过错方承担。（包括但不限于诉讼费、律师费。)
2、本协议一式两份，具有同等法律效力，分别由甲、乙双方保管。`,
  },
];
</script>

<style lang="less" scoped>
.agreement {
  background-color: #fff;
  height: 100%;
  padding: 24px;
}
</style>
